In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.DataFrame({'a':[1,2,3]})

   a
0  1
1  2
2  3

---

In [136]:
df = pd.read_csv('Data_Analysis_With_Python_P2_adult.data.csv')

In [137]:
df

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

---

In [63]:
#Cantidad de personas por ''raza''
serie = df['race'].copy()

In [68]:
id(df)

2149099444352

In [69]:
id(df)

2149117790672

In [64]:
serie

0        White
1        White
2        White
3        Black
4        Black
         ...
32556    White
32557    White
32558    White
32559    White
32560    White
Name: race, Length: 32561, dtype: object

In [65]:
serie[0] = 'Black'

In [66]:
serie

0        Black
1        White
2        White
3        Black
4        Black
         ...
32556    White
32557    White
32558    White
32559    White
32560    White
Name: race, Length: 32561, dtype: object

In [70]:
df['race'].value_counts()

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64

---

In [142]:
#edad media de los hombres
edad_media_hombres = round(df.loc[:,['age','sex']][df['sex'] == 'Male'].age.mean(),1)

In [143]:
edad_media_hombres

39.4

---

In [144]:
#porcentaje de personas con grado de licenciado
personas_bachelor = len(df['education'][df['education'] == 'Bachelors'])
total_registros = len(df)
porcentaje_personas_bachelor = round(personas_bachelor/total_registros * 100,1)

In [145]:
personas_bachelor, total, porcentaje_personas_bachelor

(5355, 32561, 16.4)

---

In [176]:
#porcentaje de personas con educacion avanzada y no avanzada
personas_estudios_avanzados = df.loc[:,['education', 'salary']][df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])]
personas_estudios_avanzados

       education salary
0      Bachelors  <=50K
1      Bachelors  <=50K
4      Bachelors  <=50K
5        Masters  <=50K
8        Masters   >50K
...          ...    ...
32538  Bachelors   >50K
32539  Doctorate   >50K
32544    Masters  <=50K
32553    Masters  <=50K
32554    Masters   >50K

[7491 rows x 2 columns]

In [179]:
personas_estudios_no_avanzados = df.loc[:,['education', 'salary']][~( df['education'].isin(['Bachelors', 'Masters', 'Doctorate']) ) ]
personas_estudios_no_avanzados

          education salary
2           HS-grad  <=50K
3              11th  <=50K
6               9th  <=50K
7           HS-grad   >50K
10     Some-college   >50K
...             ...    ...
32556    Assoc-acdm  <=50K
32557       HS-grad   >50K
32558       HS-grad  <=50K
32559       HS-grad  <=50K
32560       HS-grad   >50K

[25070 rows x 2 columns]

----

In [188]:
#personas con estudios avanzados y que ganan mas de 50k
p_est_avanz_sobre50k = personas_estudios_avanzados[personas_estudios_avanzados['salary'] == '>50K']
p_est_navanz_sobre50k = personas_estudios_no_avanzados[personas_estudios_no_avanzados['salary'] == '>50K']

In [195]:
round(len(p_est_avanz_sobre50k)/len(personas_estudios_avanzados) * 100,1)

46.5

In [193]:
round(len(p_est_avanz_sobre50k)/total_registros * 100,1)

10.7

In [196]:
round(len(p_est_navanz_sobre50k)/len(personas_estudios_no_avanzados) * 100,1)

17.4

In [194]:
round(len(p_est_navanz_sobre50k)/total_registros * 100,1)

13.4

---

In [198]:
#numero minimo de horas por semana que una persona trabaja

In [200]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'salary'],
      dtype='object')

In [207]:
personas_min_hours = df.loc[:,['hours-per-week', 'salary']]
personas_min_hours['hours-per-week'].min()

1

---

In [221]:
personas_min_hours

       hours-per-week salary
0                  40  <=50K
1                  13  <=50K
2                  40  <=50K
3                  40  <=50K
4                  40  <=50K
...               ...    ...
32556              38  <=50K
32557              40   >50K
32558              40  <=50K
32559              20  <=50K
32560              40   >50K

[32561 rows x 2 columns]

In [231]:
#porcentaje de personas que trabaja el minimo de horas a la semana
personas_trabajan_poco = len(personas_min_hours[(personas_min_hours['hours-per-week'] == 1)])

In [232]:
personas_ricas = len(personas_min_hours[(personas_min_hours['hours-per-week'] == 1) & (personas_min_hours['salary'] == '>50K')])

In [233]:
round(personas_ricas/personas_trabajan_poco * 100,1)

10.0

---

In [234]:
#pais que tiene la mayor cantidad de personas que ganan sobre 50k
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'salary'],
      dtype='object')

In [270]:
ranking_paises = df['native-country'].value_counts()
ranking_paises_sobre_50k = df[df['salary'] == '>50K']['native-country'].value_counts()

In [262]:
ranking_paises_sobre_50k.head()

United-States    7171
?                 146
Philippines        61
Germany            44
India              40
Name: native-country, dtype: int64

In [263]:
ranking_paises.head()

United-States    29170
Mexico             643
?                  583
Philippines        198
Germany            137
Name: native-country, dtype: int64

In [272]:
ranking_paises_porcentaje = round(ranking_paises_sobre_50k/ranking_paises * 100,1).sort_values(ascending = False)

In [278]:
pais_mejores_sueldos = ranking_paises_porcentaje.index[0]

In [279]:
p_pais_mejores_sueldos = ranking_paises_porcentaje[0]

In [280]:
pais_mejores_sueldos

'Iran'

In [282]:
p_pais_mejores_sueldos

41.9

---

In [292]:
empleos_india = df[['occupation', 'salary', 'native-country']][(df['salary'] == '>50K') & (df['native-country'] == 'India')].occupation.value_counts()

In [293]:
empleos_india

Prof-specialty      25
Exec-managerial      8
Tech-support         2
Other-service        2
Adm-clerical         1
Sales                1
Transport-moving     1
Name: occupation, dtype: int64

In [295]:
empleos_india.index[0]

'Prof-specialty'